/*
叛逆期的小明什么都喜欢反着做，
连看数字也是如此（负号除外），比如：
小明会把1234它看成4321；把-1234看成-4321；把230看成032 (032=32)；
把-230看成-032(-032=-32)。

现在，小明做了一些a+b和a-b的题目(a, b为整数且不含前导0)，
如果给你这些题目正确的答案，你能猜出小明会做得到什么答案吗？
*/

#include<stdio.h>
int main(){
    int a, b, x, y, s, t;
    int c = 0; 
    int d = 0;
    scanf("%d %d", &x, &y);
    a = (x+y)/2;
    b = (x-y)/2;
    while(a){
        c = c*10+a%10;
        a = a/10;
    }
    while(b){
        d = d*10+b%10;
        b = b/10;
    }
    s = c + d;
    t = c - d;
    printf("%d %d", s, t);
}